{"class_name": "Model", "config": {"name": "deeplabv3plus", "layers": [{"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "Conv", "class_name": "Conv2D", "config": {"name": "Conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "Conv_BN", "class_name": "BatchNormalization", "config": {"name": "Conv_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv", 0, 0, {}]]]}, {"name": "Conv_Relu6", "class_name": "Activation", "config": {"name": "Conv_Relu6", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["Conv_BN", 0, 0, {}]]]}, {"name": "expanded_conv_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Conv_Relu6", 0, 0, {}]]]}, {"name": "expanded_conv_depthwise_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_depthwise_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_depthwise", 0, 0, {}]]]}, {"name": "expanded_conv_depthwise_relu", "class_name": "Activation", "config": {"name": "expanded_conv_depthwise_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_depthwise_BN", 0, 0, {}]]]}, {"name": "expanded_conv_project", "class_name": "Conv2D", "config": {"name": "expanded_conv_project", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_depthwise_relu", 0, 0, {}]]]}, {"name": "expanded_conv_project_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_project_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_project", 0, 0, {}]]]}, {"name": "expanded_conv_1_expand", "class_name": "Conv2D", "config": {"name": "expanded_conv_1_expand", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_project_BN", 0, 0, {}]]]}, {"name": "expanded_conv_1_expand_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_1_expand_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_1_expand", 0, 0, {}]]]}, {"name": "expanded_conv_1_expand_relu", "class_name": "Activation", "config": {"name": "expanded_conv_1_expand_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_1_expand_BN", 0, 0, {}]]]}, {"name": "expanded_conv_1_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_1_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["expanded_conv_1_expand_relu", 0, 0, {}]]]}, {"name": "expanded_conv_1_depthwise_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_1_depthwise_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_1_depthwise", 0, 0, {}]]]}, {"name": "expanded_conv_1_depthwise_relu", "class_name": "Activation", "config": {"name": "expanded_conv_1_depthwise_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_1_depthwise_BN", 0, 0, {}]]]}, {"name": "expanded_conv_1_project", "class_name": "Conv2D", "config": {"name": "expanded_conv_1_project", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_1_depthwise_relu", 0, 0, {}]]]}, {"name": "expanded_conv_1_project_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_1_project_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_1_project", 0, 0, {}]]]}, {"name": "expanded_conv_2_expand", "class_name": "Conv2D", "config": {"name": "expanded_conv_2_expand", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_1_project_BN", 0, 0, {}]]]}, {"name": "expanded_conv_2_expand_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_2_expand_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_2_expand", 0, 0, {}]]]}, {"name": "expanded_conv_2_expand_relu", "class_name": "Activation", "config": {"name": "expanded_conv_2_expand_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_2_expand_BN", 0, 0, {}]]]}, {"name": "expanded_conv_2_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_2_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["expanded_conv_2_expand_relu", 0, 0, {}]]]}, {"name": "expanded_conv_2_depthwise_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_2_depthwise_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_2_depthwise", 0, 0, {}]]]}, {"name": "expanded_conv_2_depthwise_relu", "class_name": "Activation", "config": {"name": "expanded_conv_2_depthwise_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_2_depthwise_BN", 0, 0, {}]]]}, {"name": "expanded_conv_2_project", "class_name": "Conv2D", "config": {"name": "expanded_conv_2_project", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_2_depthwise_relu", 0, 0, {}]]]}, {"name": "expanded_conv_2_project_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_2_project_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_2_project", 0, 0, {}]]]}, {"name": "expanded_conv_2_add", "class_name": "Add", "config": {"name": "expanded_conv_2_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["expanded_conv_1_project_BN", 0, 0, {}], ["expanded_conv_2_project_BN", 0, 0, {}]]]}, {"name": "expanded_conv_3_expand", "class_name": "Conv2D", "config": {"name": "expanded_conv_3_expand", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_2_add", 0, 0, {}]]]}, {"name": "expanded_conv_3_expand_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_3_expand_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_3_expand", 0, 0, {}]]]}, {"name": "expanded_conv_3_expand_relu", "class_name": "Activation", "config": {"name": "expanded_conv_3_expand_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_3_expand_BN", 0, 0, {}]]]}, {"name": "expanded_conv_3_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_3_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["expanded_conv_3_expand_relu", 0, 0, {}]]]}, {"name": "expanded_conv_3_depthwise_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_3_depthwise_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_3_depthwise", 0, 0, {}]]]}, {"name": "expanded_conv_3_depthwise_relu", "class_name": "Activation", "config": {"name": "expanded_conv_3_depthwise_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_3_depthwise_BN", 0, 0, {}]]]}, {"name": "expanded_conv_3_project", "class_name": "Conv2D", "config": {"name": "expanded_conv_3_project", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_3_depthwise_relu", 0, 0, {}]]]}, {"name": "expanded_conv_3_project_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_3_project_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_3_project", 0, 0, {}]]]}, {"name": "expanded_conv_4_expand", "class_name": "Conv2D", "config": {"name": "expanded_conv_4_expand", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_3_project_BN", 0, 0, {}]]]}, {"name": "expanded_conv_4_expand_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_4_expand_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_4_expand", 0, 0, {}]]]}, {"name": "expanded_conv_4_expand_relu", "class_name": "Activation", "config": {"name": "expanded_conv_4_expand_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_4_expand_BN", 0, 0, {}]]]}, {"name": "expanded_conv_4_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_4_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["expanded_conv_4_expand_relu", 0, 0, {}]]]}, {"name": "expanded_conv_4_depthwise_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_4_depthwise_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_4_depthwise", 0, 0, {}]]]}, {"name": "expanded_conv_4_depthwise_relu", "class_name": "Activation", "config": {"name": "expanded_conv_4_depthwise_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_4_depthwise_BN", 0, 0, {}]]]}, {"name": "expanded_conv_4_project", "class_name": "Conv2D", "config": {"name": "expanded_conv_4_project", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_4_depthwise_relu", 0, 0, {}]]]}, {"name": "expanded_conv_4_project_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_4_project_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_4_project", 0, 0, {}]]]}, {"name": "expanded_conv_4_add", "class_name": "Add", "config": {"name": "expanded_conv_4_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["expanded_conv_3_project_BN", 0, 0, {}], ["expanded_conv_4_project_BN", 0, 0, {}]]]}, {"name": "expanded_conv_5_expand", "class_name": "Conv2D", "config": {"name": "expanded_conv_5_expand", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_4_add", 0, 0, {}]]]}, {"name": "expanded_conv_5_expand_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_5_expand_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_5_expand", 0, 0, {}]]]}, {"name": "expanded_conv_5_expand_relu", "class_name": "Activation", "config": {"name": "expanded_conv_5_expand_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_5_expand_BN", 0, 0, {}]]]}, {"name": "expanded_conv_5_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_5_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["expanded_conv_5_expand_relu", 0, 0, {}]]]}, {"name": "expanded_conv_5_depthwise_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_5_depthwise_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_5_depthwise", 0, 0, {}]]]}, {"name": "expanded_conv_5_depthwise_relu", "class_name": "Activation", "config": {"name": "expanded_conv_5_depthwise_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_5_depthwise_BN", 0, 0, {}]]]}, {"name": "expanded_conv_5_project", "class_name": "Conv2D", "config": {"name": "expanded_conv_5_project", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_5_depthwise_relu", 0, 0, {}]]]}, {"name": "expanded_conv_5_project_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_5_project_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_5_project", 0, 0, {}]]]}, {"name": "expanded_conv_5_add", "class_name": "Add", "config": {"name": "expanded_conv_5_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["expanded_conv_4_add", 0, 0, {}], ["expanded_conv_5_project_BN", 0, 0, {}]]]}, {"name": "expanded_conv_6_expand", "class_name": "Conv2D", "config": {"name": "expanded_conv_6_expand", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_5_add", 0, 0, {}]]]}, {"name": "expanded_conv_6_expand_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_6_expand_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_6_expand", 0, 0, {}]]]}, {"name": "expanded_conv_6_expand_relu", "class_name": "Activation", "config": {"name": "expanded_conv_6_expand_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_6_expand_BN", 0, 0, {}]]]}, {"name": "expanded_conv_6_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_6_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["expanded_conv_6_expand_relu", 0, 0, {}]]]}, {"name": "expanded_conv_6_depthwise_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_6_depthwise_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_6_depthwise", 0, 0, {}]]]}, {"name": "expanded_conv_6_depthwise_relu", "class_name": "Activation", "config": {"name": "expanded_conv_6_depthwise_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_6_depthwise_BN", 0, 0, {}]]]}, {"name": "expanded_conv_6_project", "class_name": "Conv2D", "config": {"name": "expanded_conv_6_project", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_6_depthwise_relu", 0, 0, {}]]]}, {"name": "expanded_conv_6_project_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_6_project_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_6_project", 0, 0, {}]]]}, {"name": "expanded_conv_7_expand", "class_name": "Conv2D", "config": {"name": "expanded_conv_7_expand", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_6_project_BN", 0, 0, {}]]]}, {"name": "expanded_conv_7_expand_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_7_expand_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_7_expand", 0, 0, {}]]]}, {"name": "expanded_conv_7_expand_relu", "class_name": "Activation", "config": {"name": "expanded_conv_7_expand_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_7_expand_BN", 0, 0, {}]]]}, {"name": "expanded_conv_7_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_7_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [2, 2], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["expanded_conv_7_expand_relu", 0, 0, {}]]]}, {"name": "expanded_conv_7_depthwise_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_7_depthwise_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_7_depthwise", 0, 0, {}]]]}, {"name": "expanded_conv_7_depthwise_relu", "class_name": "Activation", "config": {"name": "expanded_conv_7_depthwise_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_7_depthwise_BN", 0, 0, {}]]]}, {"name": "expanded_conv_7_project", "class_name": "Conv2D", "config": {"name": "expanded_conv_7_project", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_7_depthwise_relu", 0, 0, {}]]]}, {"name": "expanded_conv_7_project_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_7_project_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_7_project", 0, 0, {}]]]}, {"name": "expanded_conv_7_add", "class_name": "Add", "config": {"name": "expanded_conv_7_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["expanded_conv_6_project_BN", 0, 0, {}], ["expanded_conv_7_project_BN", 0, 0, {}]]]}, {"name": "expanded_conv_8_expand", "class_name": "Conv2D", "config": {"name": "expanded_conv_8_expand", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_7_add", 0, 0, {}]]]}, {"name": "expanded_conv_8_expand_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_8_expand_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_8_expand", 0, 0, {}]]]}, {"name": "expanded_conv_8_expand_relu", "class_name": "Activation", "config": {"name": "expanded_conv_8_expand_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_8_expand_BN", 0, 0, {}]]]}, {"name": "expanded_conv_8_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_8_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [2, 2], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["expanded_conv_8_expand_relu", 0, 0, {}]]]}, {"name": "expanded_conv_8_depthwise_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_8_depthwise_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_8_depthwise", 0, 0, {}]]]}, {"name": "expanded_conv_8_depthwise_relu", "class_name": "Activation", "config": {"name": "expanded_conv_8_depthwise_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_8_depthwise_BN", 0, 0, {}]]]}, {"name": "expanded_conv_8_project", "class_name": "Conv2D", "config": {"name": "expanded_conv_8_project", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_8_depthwise_relu", 0, 0, {}]]]}, {"name": "expanded_conv_8_project_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_8_project_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_8_project", 0, 0, {}]]]}, {"name": "expanded_conv_8_add", "class_name": "Add", "config": {"name": "expanded_conv_8_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["expanded_conv_7_add", 0, 0, {}], ["expanded_conv_8_project_BN", 0, 0, {}]]]}, {"name": "expanded_conv_9_expand", "class_name": "Conv2D", "config": {"name": "expanded_conv_9_expand", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_8_add", 0, 0, {}]]]}, {"name": "expanded_conv_9_expand_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_9_expand_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_9_expand", 0, 0, {}]]]}, {"name": "expanded_conv_9_expand_relu", "class_name": "Activation", "config": {"name": "expanded_conv_9_expand_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_9_expand_BN", 0, 0, {}]]]}, {"name": "expanded_conv_9_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_9_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [2, 2], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["expanded_conv_9_expand_relu", 0, 0, {}]]]}, {"name": "expanded_conv_9_depthwise_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_9_depthwise_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_9_depthwise", 0, 0, {}]]]}, {"name": "expanded_conv_9_depthwise_relu", "class_name": "Activation", "config": {"name": "expanded_conv_9_depthwise_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "inbound_nodes": [[["expanded_conv_9_depthwise_BN", 0, 0, {}]]]}, {"name": "expanded_conv_9_project", "class_name": "Conv2D", "config": {"name": "expanded_conv_9_project", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["expanded_conv_9_depthwise_relu", 0, 0, {}]]]}, {"name": "expanded_conv_9_project_BN", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_9_project_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["expanded_conv_9_project", 0, 0, {}]]]}, {"name": "expanded_conv_9_add", "class_name": "Add", "config": {"name": "expanded_conv_9_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["expanded_conv_8_add", 0, 0, {}], ["expanded_conv_9_project_BN", 0, 0, {}]]]}, {"name": "expanded_conv_10_expand", "class_name": "Conv2D", "config": {"name": "expanded_conv_10_expand", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1,